Revit 2026 API

# SchemaCommonCategory Property

---

The property labeled "Category" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string Category { get; }
```
```vb
Public Shared ReadOnly Property Category As String
	Get
```
```cpp
public:
static property String^ Category {
	String^ get ();
}
```
```fsharp
static member Category : string with get
```

#### Property Value

String

This property is of type "AssetPropertyString".

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace